In [2]:
import pandas as pd
import numpy as np

# 6.1 读写文本格式的数据

In [3]:
xyz = pd.read_json('datasets/usda_food/database.json')
print(xyz.head())

     id                         description tags manufacturer  \
0  1008                     Cheese, caraway   []
1  1009                     Cheese, cheddar   []
2  1018                        Cheese, edam   []
3  1019                        Cheese, feta   []
4  1028  Cheese, mozzarella, part skim milk   []

                    group                                           portions  \
0  Dairy and Egg Products      [{'amount': 1, 'unit': 'oz', 'grams': 28.35}]
1  Dairy and Egg Products  [{'amount': 1, 'unit': 'cup, diced', 'grams': ...
2  Dairy and Egg Products  [{'amount': 1, 'unit': 'oz', 'grams': 28.35}, ...
3  Dairy and Egg Products  [{'amount': 1, 'unit': 'cup, crumbled', 'grams...
4  Dairy and Egg Products      [{'amount': 1, 'unit': 'oz', 'grams': 28.35}]

                                           nutrients
0  [{'value': 25.18, 'units': 'g', 'description':...
1  [{'value': 24.9, 'units': 'g', 'description': ...
2  [{'value': 4.22, 'units': 'g', 'description': ...
3  [{'value': 5.2, 'units': 'g', 'description': '...
4  [{'value': 3.27, 'units': 'g', 'description': ...

In [4]:
df = pd.read_csv('examples/ex1.csv')
print(df)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
#并不是所有文件都有表头，可以自己设置
df2 = pd.read_csv('examples/ex2.csv',header=None)
df3 = pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])
print(df2,'\n',df3)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo
    a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
#还可指明索引
df4 = pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'],index_col='message')
print(df4)

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col=['key1','key2'])
print(parsed)

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [10]:
#有时表格使用的可能不是固定的分隔符，而是空白或者其他方式分隔字段
result = pd.read_csv('examples/ex3.txt',sep='\\s+')
print(result)

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
#跳过固定行
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## 6.1.1逐块读取文本文件

In [23]:
pd.options.display.max_rows= 10

In [13]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [14]:
#只读取几行
pd.read_csv('examples/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [27]:
chunker = pd.read_csv('examples/ex6.csv',chunksize=1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [28]:
tot = pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
tot = tot.sort_values()
tot[:10]

key
1    146
9    150
0    151
2    152
5    157
3    162
8    162
7    164
6    166
4    171
dtype: object

## 6.1.2将数据写入文本格式

In [29]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
data.to_csv('examples/out.csv')

## 6.1.4JSON数据

In [3]:
import json
with open('examples/example.json', 'r') as file:
    data = json.load(file) 
print(data)
data = pd.DataFrame(data,columns=['a','b'])
print(data)

[{'a': 1, 'b': 2, 'c': 3}, {'a': 4, 'b': 5, 'c': 6}, {'a': 7, 'b': 8, 'c': 9}]
   a  b
0  1  2
1  4  5
2  7  8

## 6.1.5XML和HTML:网络抓取

In [5]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)

1

In [6]:
failures = tables[0]

In [7]:
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [8]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

In [ ]:
#from lxml import objectify
#path = 'datasets/mta_perf/Performance_MNR.xml'
#with open(path) as f:
    parsed = objectify.parse(f)
#root = parsed.getroot()

## 6.2.1读取microsoft excel 文件

In [10]:
#使用pandas.ExcelFile类或pandas.read_excel函数，必须使用pip 或 conda 安装 openpyxl xlrd
xlsx = pd.ExcelFile('examples/ex1.xlsx')
print(xlsx)

<pandas.io.excel._base.ExcelFile object at 0x7fe8204c4da0>

In [11]:
xlsx.sheet_names

['Sheet1']

In [12]:
xlsx.parse()
# 解析多个工作表
#dfs = xlsx.parse(sheet_name=['Sheet1', 'Sheet3'])

# 显示多个工作表的内容
#for sheet_name, df in dfs.items():
    #print(f"Sheet: {sheet_name}")
    #print(df)

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [13]:
frame = pd.read_excel('examples/ex1.xlsx')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo